JanusDG/POC_Lab_06/Design_Task_02.2.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "FrequencyCounter.h"
#include "PWM_1sWindow.h"
#include "Clock_1kHz.h"
#include "Clock_Counter.h"
#include "ADC_SAR_Seq.h"
#include "UART.h"
#include "UART_SPI_UART.h"
#include "UART_PINS.h"
#include "UART_SPI_UART_PVT.h"
#include "UART_PVT.h"
#include "UART_BOOT.h"
#include "isr_Counter.h"
#include "Pin_Freq.h"
#include "Pin_Freq_aliases.h"
#include "Pin_1sWindow.h"
#include "Pin_1sWindow_aliases.h"
#include "Pin_AIn_p.h"
#include "Pin_AIn_p_aliases.h"
#include "ADC_SAR_Seq_IRQ.h"
#include "ADC_SAR_Seq_intClock.h"
#include "UART_SCBCLK.h"
#include "UART_tx.h"
#include "UART_tx_aliases.h"
#include "UART_rx.h"
#include "UART_rx_aliases.h"
#include "cy_em_eeprom.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"

/*[]*/

